src/Documents/УценкаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УценкаТовара</Name>
			<Comment>Уценка товара</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаУценку</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.УценкаТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОконачанияДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЦентральногоОфиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
					<Comment>Таблица скидок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Товар или группа на которую действует скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВычисления</Name>
							<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Comment>Значение скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрих-код</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОконачанияДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад/Отдел</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается цены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УценкаТовара</Name>
					<Comment>Уценка товара</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОконачанияДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/УценкаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УценкаТовара</Name>
			<Comment>Сведения о скидках назначаемых на каждую товарную строку документов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОформленВЦО</Name>
					<Comment>Оформлен в центральном офисе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Товар, на который назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТоварыВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТоварыВОборудовании</Name>
			<Comment>Сведения о товарах которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки PLU</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполненаПечатьЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрих-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/УценкаТовара/Ext/ObjectModule.bsl
// Модуль документа "Назначение скидок строки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПроверитьЦены(Отказ)
	
	ПравилоПроверкиУценки = ПолучитьЗначениеУчетнойПолитики("ПравилоПроверкиУценкиПоСпособуВычисления", ПодразделениеКомпании);
	
	Если ПравилоПроверкиУценки = Перечисления.ПравилоПроверкиУценкиПоСпособуВычисления.НеПроверять Тогда
		Возврат
	КонецЕсли;
	
	ЗначениеИсключения = Неопределено;
	Если ПравилоПроверкиУценки = Перечисления.ПравилоПроверкиУценкиПоСпособуВычисления.ПроверятьФиксированнуюУценку Тогда
		ЗначениеИсключения = Перечисления.СкидкиСпособВычисления.Относительная;
	ИначеЕсли ПравилоПроверкиУценки = Перечисления.ПравилоПроверкиУценкиПоСпособуВычисления.ПроверятьОтносительнуюУценку Тогда
		ЗначениеИсключения = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена;
	КонецЕсли;
	
	ТаблицаЦен = Документы.УценкаТовара.ПолучитьТаблицуЦен(ЭтотОбъект, Скидки);
	
	ФиксированнаяЦена = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена;
	
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		
		//Если СтрокаЦен.Приоритет Тогда
		Если СтрокаЦен.ОформленВЦО Тогда
			Продолжить;
		КонецЕсли;
		
		ЦенаЛимита = Окр(СтрокаЦен.ЦенаЛимита, 2);
		
		ТекущаяСтрока = Скидки[СтрокаЦен.ИндексСтроки];
		
		Если ТекущаяСтрока.СпособВычисления = ЗначениеИсключения Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.СпособВычисления = ФиксированнаяЦена Тогда
			ИтоговаяЦена = ТекущаяСтрока.ЗначениеСкидки;
		ИначеЕсли НЕ СтрокаЦен.ЦенаРозничная = 0 И ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеСкидки) Тогда
			ИтоговаяЦена = СтрокаЦен.ЦенаРозничная - СтрокаЦен.ЦенаРозничная*(ТекущаяСтрока.ЗначениеСкидки/100);
			ИтоговаяЦена = Справочники.ВариантыОкругления.ОкруглитьЦену(ТекущаяСтрока.ВариантОкругления, ИтоговаяЦена);
		Иначе
			ИтоговаяЦена = СтрокаЦен.ЦенаРозничная;
		КонецЕсли;
		
		Если ИтоговаяЦена<ЦенаЛимита Тогда
			ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(ТекущаяСтрока.Номенклатура.Код)+"] "+СокрЛП(ТекущаяСтрока.Номенклатура) 
								+ НСтр("ru = 'Устанавливаемая цена : %1 меньше допустимой: %2'"),
								ЭтотОбъект,,ТекущаяСтрока.НомерСтроки,Отказ, ИтоговаяЦена, ЦенаЛимита);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНоменклатуру(Отказ)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатуры)
	|	И Номенклатура.ШтрихКодСвежесть = """"");
	Запрос.УстановитьПараметр("СписокНоменклатуры",Скидки.ВыгрузитьКолонку("Номенклатура"));
	ВыбЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыбЗапроса.Следующий() Цикл
		ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(ВыбЗапроса.Номенклатура.Код)+"] "+СокрЛП(ВыбЗапроса.Номенклатура)+" " 
							+ НСтр("ru = 'Номенклатура не может использоваться в уценке'"),
							ЭтотОбъект,,,Отказ);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем заполнение реквизитов документа
	Если НЕ ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
		ДатаНачалаДействия = Дата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОконачанияДействия) Тогда
		ДатаОконачанияДействия = КонецДня(ДатаНачалаДействия+7*(60*60*24));
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем заполнение реквизитов документа
	ДатаНачалаДействия = ТекущаяДатаСеанса();
	ДокументЦентральногоОфиса = Ложь;
	
КонецПроцедуры

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ, РежимЗаписи, РежимПроведения);
	
	ДисконтнаяКарта = Справочники.Карточки.ПустаяСсылка();
	Правило         = Перечисления.ПравилаРасчетаСкидкиПоКоличеству.НеИспользуется;
	Скидка          = Справочники.ТипыСкидок.СкидкаНаШтрихкодТовара;
	НачВремя        = Дата("00010101000000");
	КонВремя        = Дата("00010101235959");
	ДатаНачалаДействия = Макс(ДатаНачалаДействия, Дата);
	
	// установим идентификатор скидки для каждой строки
	Для Каждого Строка Из Скидки Цикл
		
		Если (НЕ ЗначениеЗаполнено(Строка.ДатаНачалаДействия)) И (НЕ ЗначениеЗаполнено(Строка.ДатаОконачанияДействия)) Тогда
			Строка.ДатаНачалаДействия     = ДатаНачалаДействия;
			Строка.ДатаОконачанияДействия = ДатаОконачанияДействия;
		КонецЕсли;
		
		Строка.ДатаНачалаДействия = Макс(Строка.ДатаНачалаДействия, Дата);
		
	КонецЦикла;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДокументЦентральногоОфиса Тогда
		ПроверитьЦены(Отказ);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//ПроверитьНоменклатуру(Отказ); //skud закоментил, ибо это не правильно, надо рабираться
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ,Проведение=Ложь)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
	Если МассивПодразделений.Количество() = 0 Тогда
		МассивПодразделений.Добавить(ПодразделениеКомпании);
	КонецЕсли;
	
	РезультатЗапросаПоСкидкам = Документы.УценкаТовара.ПолучитьТаблицуСкидок(ЭтотОбъект);
	
	Для Каждого ТекущееПодразделение Из МассивПодразделений Цикл
		// Делаем движения по регистру "СкидкиСтроки"
		НаборЗаписейСкидки = Движения.УценкаТовара;
		НаборЗаписейСкидки.ДокументСсылка            = Ссылка;
		НаборЗаписейСкидки.ПодразделениеКомпании     = ТекущееПодразделение;
		НаборЗаписейСкидки.РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам;
		
		Если ХозОперация = Справочники.ХозОперации.ОтменаУценкиТоваров Тогда
			// Отмена уценки
			Отказ = Отказ ИЛИ НаборЗаписейСкидки.ОтменитьСкидки();
		Иначе
			// Установка уценки
			Отказ = Отказ ИЛИ НаборЗаписейСкидки.УстановитьСкидки();
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров
	|ПОМЕСТИТЬ
	|	ГруппыТоваровОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании В (&ПодразделенияКомпании)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыТоваровОборудования.ГруппаТоваров,
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.ШтрихКод
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	Документ.УценкаТовара.Скидки КАК ТаблицаСкидок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ПО
	|	ИСТИНА
	|ГДЕ
	|	ТаблицаСкидок.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.ШтрихКод,
	|	ТаблицаСкидок.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаСкидок.ГруппаТоваров.ЗаполнятьПропуски КАК ЗаполнятьПропуски,
	|	МИНИМУМ(ВЫБОР
	|		КОГДА ТоварыВОборудовании.Штрихкод=ТаблицаСкидок.ШтрихКод ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ) КАК НоваяЗапись,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ТоварыВОборудовании.Штрихкод=ТаблицаСкидок.ШтрихКод ТОГДА
	|			ТоварыВОборудовании.НомерЯчейки
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) КАК НомерЯчейки
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТаблицаСкидок.ГруппаТоваров = ТоварыВОборудовании.ГруппаТоваров И 
	|	ТаблицаСкидок.Номенклатура = ТоварыВОборудовании.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.ШтрихКод,
	|	ТаблицаСкидок.ГруппаТоваров
	//|ИМЕЮЩИЕ
	//|	МИНИМУМ(ВЫБОР
	//|		КОГДА ТоварыВОборудовании.Штрихкод=ТаблицаСкидок.ШтрихКод ТОГДА
	//|			ЛОЖЬ
	//|		ИНАЧЕ
	//|			ИСТИНА
	//|	КОНЕЦ) = ИСТИНА
	|ИТОГИ ПО
	|	ГруппаТоваров
	|";
	
	Запрос.УстановитьПараметр("Ссылка",                Ссылка);
	Запрос.УстановитьПараметр("ПодразделенияКомпании", МассивПодразделений);
	
	ВыборкаПоГруппам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоГруппам.Следующий() Цикл
		НомерЯчейки = 0;
		КоличествоСвободныхЯчеек = 0;
		ГруппаТоваров     = ВыборкаПоГруппам.ГруппаТоваров;
		ЗаполнятьПропуски = ВыборкаПоГруппам.ЗаполнятьПропуски;
		
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("ГруппаТоваров", ГруппаТоваров);
		
		ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,,Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗаполнятьПропуски Тогда
			СвободныеНомераЯчеек = РегистрыСведений.ТоварыВОборудовании.ПолучитьСвободныеНомераЯчеек(ГруппаТоваров);
			КоличествоСвободныхЯчеек = СвободныеНомераЯчеек.Количество();
		Иначе
			НомерЯчейки = РегистрыСведений.ТоварыВОборудовании.ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров);
		КонецЕсли;
		ПередачаПослеПечати = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПередачаВОборудованиеПослеПечати, Справочники.ГруппыТоваровОборудования.ПолучитьПодразделениеКомпанииПоГруппеТоваров(ГруппаТоваров));
		Выборка = ВыборкаПоГруппам.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяЗапись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи(); 
			НоваяЗапись.ГруппаТоваров   = ГруппаТоваров;
			НоваяЗапись.Номенклатура    = Выборка.Номенклатура;
			НоваяЗапись.ШтрихКод        = Выборка.ШтрихКод;
			НоваяЗапись.МоментИзменения = ТекущаяДата();
			НоваяЗапись.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
			Если Выборка.НоваяЗапись Тогда
				Если КоличествоСвободныхЯчеек>0 Тогда
					ТекущийИндекс = КоличествоСвободныхЯчеек-1;
					НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
					СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
					КоличествоСвободныхЯчеек=КоличествоСвободныхЯчеек-1;
				Иначе
					НомерЯчейки = НомерЯчейки+1;
				КонецЕсли;
				ТекНомерЯчейки = НомерЯчейки;
			Иначе
				ТекНомерЯчейки = Выборка.НомерЯчейки;
			КонецЕсли;
			
			НоваяЗапись.НомерЯчейки = ТекНомерЯчейки;
			
			Попытка
				НоваяЗапись.Записать();
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
	Если ХозОперация = Справочники.ХозОперации.ОтменаУценкиТоваров Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УценкаТовараСкидки.Номенклатура КАК Номенклатура,
	|	УценкаТовараСкидки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УценкаТовараСкидки.Штрихкод КАК Штрихкод
	|ИЗ
	|	Документ.УценкаТовара.Скидки КАК УценкаТовараСкидки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ПО
	|	УценкаТовараСкидки.Номенклатура = Штрихкоды.Объект И 
	|	УценкаТовараСкидки.Штрихкод = Штрихкоды.Штрихкод
	|ГДЕ
	|	УценкаТовараСкидки.Ссылка = &Ссылка И 
	|	Штрихкоды.Объект ЕСТЬ NULL И 
	|	(НЕ УценкаТовараСкидки.Штрихкод = """")
	|";
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписиШтрихКоды = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписиШтрихКоды.Штрихкод         = Выборка.Штрихкод;
			МенеджерЗаписиШтрихКоды.Объект           = Выборка.Номенклатура;
			МенеджерЗаписиШтрихКоды.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			Попытка
				МенеджерЗаписиШтрихКоды.Записать(Истина);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПроведения


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
